app/views/marks/_form.html.erb

SELECT `students`.* FROM `students`
---
    <%= f.label :student_id %><br>
    <%= f.collection_select :student_id, Student.all, :id, :l_name, prompt: true %>

SELECT `subjects`.* FROM `subjects`
---
    <%= f.label :subject_id %><br>
    <%= f.collection_select :subject_id, Subject.all, :id, :subject_name, prompt: true %>

SELECT `grades`.* FROM `grades`
---
    <%= f.label :grade_id %><br>
    <%= f.collection_select :grade_id, Grade.all, :id, :grade_name, prompt: true %>