app/views/subject_teachers/_form.html.erb

      <div class="col-sm-8">
        <%= f.collection_select :subject_id, Subject.all, :id, :subject_code, prompt: true %>
---
SELECT `subjects`.* FROM `subjects`

        <div class="col-sm-8">
          <%= f.collection_select :user_id, User.all, :id, :l_name, prompt: true %>
---
SELECT `users`.* FROM `users`