app/controllers/grades_controller.rb

  def index
    @grades = Grade.all
---
SELECT `grades`.* FROM `grades`

  def show
    @grade = Grade.find(params[:id])
---
SELECT  `grades`.* FROM `grades` WHERE `grades`.`id` = 1 LIMIT 1

  def create
    @grade = Grade.new(grade_params)

      if @grade.save
---
INSERT INTO `grades` (`grade_name`, `created_at`, `updated_at`) VALUES ('Second', '2017-10-25 22:50:19', '2017-10-25 22:50:19')