app/controllers/marks_controller.rb

SELECT `marks`.* FROM `marks`
---
  def index
    @marks = Mark.paginate(page: params[:page], per_page: 25)

INSERT INTO `marks` (`mark`, `student_id`, `subject_id`, `grade_id`, `created_at`, `updated_at`) VALUES (90, 1, 1, 1, '2017-10-25 22:54:42', '2017-10-25 22:54:42')
---
  def create
    @mark = Mark.new(mark_params)
    @mark.user_id = session[:user_id]
    respond_to do |format|
      if @mark.save

SELECT  `marks`.* FROM `marks` WHERE `marks`.`id` = 1 LIMIT 1
---
    def set_mark
      @mark = Mark.find(params[:id])