app/controllers/sessions_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`email` = 'iabdulaziz.a@gmail.com' LIMIT 1
---
  def create
    student = Student.find_by(email: params[:session][:email].downcase)

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'm661m_m661m@hotmail.com' LIMIT 1
---
  def usercreate
    user = User.find_by(email: params[:session][:email].downcase)