app/controllers/students_controller.rb

  def index
    @students = Student.paginate(page: params[:page], per_page: 15)
---
SELECT  `students`.* FROM `students` LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `students`

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO `students` (`f_name`, `l_name`, `nationality`, `address`, `city`, `post_code`, `gender`, `phone`, `email`, `dob`, `username`, `password_digest`, `created_at`, `updated_at`) VALUES ('Abdulaziz', 'ALothaim', 'Saudi', '21 xavier ', 'Dublin', '12345', 'male', '088188822', 'aziz@example.com', '22-8-1988', 'abdulaziz', '$2a$10$nCZrOxOuONlT6t5A6g2uP.D3QCvFvo9eFDC.YKDm4SnpDr3XcLXki', '2017-10-25 20:51:16', '2017-10-25 20:51:16')

  def update
    if @student.update(student_params)
---
UPDATE `students` SET `phone` = '0923999222', `email` = 'aziz@example.io', `dob` = '22-8-1988', `username` = 'abdulaziz', `password` = '12345', `updated_at` = '2017-10-23 19:17:55' WHERE `students`.`id` = 1

  def destroy
    @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1