app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.paginate(page: params[:page], per_page: 12)
---
SELECT `subjects`.* FROM `subjects`

  def create
    @subject = Subject.new(subject_params)

      if @subject.save
---
INSERT INTO `subjects` (`subject_name`, `subject_code`, `created_at`, `updated_at`) VALUES ('Math', 'MATH-101', '2017-10-25 22:47:36', '2017-10-25 22:47:36')

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1