app/controllers/subject_teachers_controller.rb

SELECT `subject_teachers`.* FROM `subject_teachers`
---
  def index
    @subject_teachers = SubjectTeacher.all

INSERT INTO `subject_teachers` (`subject_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-10-25 22:48:17', '2017-10-25 22:48:17')
---
  def create
    @subject_teacher = SubjectTeacher.new(subject_teacher_params)

    respond_to do |format|
      if @subject_teacher.save

DELETE FROM `subject_teachers` WHERE `subject_teachers`.`id` = 1
---
  def destroy
    @subject_teacher.destroy

SELECT  `subject_teachers`.* FROM `subject_teachers` WHERE `subject_teachers`.`id` = 2 LIMIT 1
---
    def set_subject_teacher
      @subject_teacher = SubjectTeacher.find(params[:id])