app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 15)
---
SELECT  `users`.* FROM `users` LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`f_name`, `l_name`, `email`, `dob`, `password_digest`, `nationality`, `national_id`, `gender`, `created_at`, `updated_at`) VALUES ('lsdkfg', 'lkjlkj', 'a@a.com', 'lk', '$2a$10$NYcCxuJb.AX6K2RUlMusGe/YEEKiwvdKH8iSIgPY1L7A1j70QEKsm', ';klsfjlkkjlk', 'lklkj', 'kjnljnl', '2017-10-25 22:37:26', '2017-10-25 22:37:26')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `role` = 'admin', `updated_at` = '2017-11-05 23:45:36' WHERE `users`.`id` = 1